In [1]:
import pandas as pd
import numpy as np

## Cadastro da loja A

In [2]:
cad_a = {
            "Id":     ['AA2930', 'BB4563', 'CC2139', 'DE2521', 'GT3462', 'HH1158'],
            "Nome":   ['Victor', 'Danielle', 'Bruna', 'Carlos', 'Ricardo', 'Maria'],
            "Idade":  [20,35,40,54,30,27],
            "CEP":    ['00092-029','11111-111','22222-888','00000-999','88888-111','77777-666']
}
cad_a = pd.DataFrame(cad_a)
cad_a

       Id      Nome  Idade        CEP
0  AA2930    Victor     20  00092-029
1  BB4563  Danielle     35  11111-111
2  CC2139     Bruna     40  22222-888
3  DE2521    Carlos     54  00000-999
4  GT3462   Ricardo     30  88888-111
5  HH1158     Maria     27  77777-666

## Cadastro da loja B

In [3]:
cad_b = {
            "Id":     ['CC9999', 'EF4488', 'DD9999', 'GT3462', 'HH1158'],
            "Nome":   ['Marcos', 'Patricia', 'Ericka', 'Ricardo', 'Maria'],
            "Idade":  [19,30,22,30,27],
            "CEP":    ['00092-029','11111-111','11111-888', '88888-111','77777-666']
}
cad_b = pd.DataFrame(cad_b)
cad_b

       Id      Nome  Idade        CEP
0  CC9999    Marcos     19  00092-029
1  EF4488  Patricia     30  11111-111
2  DD9999    Ericka     22  11111-888
3  GT3462   Ricardo     30  88888-111
4  HH1158     Maria     27  77777-666

## Registro de compras de todas unidades

In [4]:
compras = {
            "Id" :    ['AA2930', 'EF4488', 'CC2139', 'EF4488', 'CC9999', 'AA2930', 'HH1158', 'HH1158'],
            "Data":   ['2019-01-01', '2019-01-30', '2019-01-30', '2019-02-01', '2019-02-20', '2019-03-15', '2019-04-01', '2019-04-10'],
            "Valor":  [200,100,40,150,300,25,50,500]
}
compras = pd.DataFrame(compras)
compras

       Id        Data  Valor
0  AA2930  2019-01-01    200
1  EF4488  2019-01-30    100
2  CC2139  2019-01-30     40
3  EF4488  2019-02-01    150
4  CC9999  2019-02-20    300
5  AA2930  2019-03-15     25
6  HH1158  2019-04-01     50
7  HH1158  2019-04-10    500

In [5]:
# pd.merge(tabela_da_esquerda, tabela_da_direita, on="Coluna_conincidente", how="left|right|inner|outer")